{
  "navbar.signals": "Signale",
  "navbar.poweron": "Einschalten",
  "navbar.poweroff": "Ausschalten",
  "navbar.setup": "Einrichten",
  "navbar.settings": "Einstellungen",
  "navbar.help": "Hilfe",

  "app.impressum": "Impressum",
  "app.privacy": "Datenschutzerklärung",
  "app.cookies.title": "Privacy-/Cookie-Einstellungen",
  "app.cookies.description": "Wir verwenden Cookies, um Google Analytics zu aktivieren. Dies kann jederzeit in den Einstellungen geändert werden. Bitte wählen:",
  "app.cookies.accept": "Alle Cookies akzeptieren",
  "app.cookies.reject": "Ablehnen",

  "app.title": "RCC - Information Panel",
  "app.introduction": "Dieses Panel erklärt die Signal-Codes des RCC (RGB Color LED Cube). Des weiteren gibt es auch Informationen darüber, wie man die Farbe und Intensität der LEDs einstellt. Informationen über das Projekt finden sich <a href=\"{{link}}\" target=\"_blank\">hier</a>. Für Fragen und Vorschläge kann jederzeit ein Issue auf GitHub erstellt werden. Um die Interaktion zu starten, klicken einfach auf das Bild unten klicken oder zu den verschiedenen Kategorien über das Menü wechseln.",

  "app.copyright.published": "<b>g.raf^engineering</b>, veröffentlicht unter <a href=\"{{link}}\" target=\"_blank\">{{name}}</a>.",
  "app.global.click": "Dürcken um zu starten",

  "settings.theme.title": "Theme",
  "settings.theme.light": "Hell",
  "settings.theme.dark": "Dunkel",
  "settings.location.title": "Standort",
  "settings.language.selection": "Sprache auswählen",

  "settings.poweroff.title": "RCC - Ausschaltsequenz",
  "settings.poweroff.description": "Nach dem Erkennungssignal des Tastendrucks (grün) wird die Ausschaltsequenz aktiviert, wenn die Taste 5 Sekunden lang gehalten wird! Wenn die Sequenz unterbrochen wird (Taste losgelassen), wechselt der RCC in den Einrichtungsmodus!",

  "settings.help.title": "Hilfe",
  "settings.help.description": "Hilfe und Anleitungen zur Verwendung des RCC Information Panels.",

  "imprint.title": "Impressum",
  "imprint.description": "Bei dieser Website handelt es sich um eine persönliche, nicht-kommerzielle Website. Die Inhalte werden ausschließlich zu Informations- und Bildungszwecken bereitgestellt.",
  "imprint.responsible": "Verantwortlich für den Inhalt:",
  "imprint.name": "R. GAECHTER",
  "imprint.location": "Österreich",
  "imprint.contact": "LinkedIn:",
  "imprint.notice.title": "Hinweis",
  "imprint.notice.description": "Diese Website wird auf privater Basis betrieben und ist mit keinem Unternehmen oder keiner kommerziellen Einrichtung verbunden. Es gelten keine Steuernummer, Umsatzsteuer-ID oder Gewerbeanmeldung.",
  "imprint.liability.title": "Haftung für Inhalte:",
  "imprint.liability.description": "Die Inhalte dieser Website werden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte kann jedoch keine Gewähr übernommen werden. Als privater Anbieter bin ich gemäß den geltenden Gesetzen für eigene Inhalte auf diesen Seiten verantwortlich. Eine fortlaufende Überwachung von fremden Inhalten (z.B. Kommentare oder externe Links) findet nicht statt, aber bei Bekanntwerden von Rechtsverletzungen werden solche Inhalte umgehend entfernt.",
  "imprint.externallinks.title": "Haftung für externe Links:",
  "imprint.externallinks.description": "Diese Website kann Links zu externen Websites enthalten. Ich habe keinen Einfluss auf die Inhalte solcher Websites und übernehme daher keine Verantwortung für diese. Zum Zeitpunkt der Verlinkung waren keine Rechtsverstöße erkennbar. Bei Bekanntwerden von Rechtsverletzungen werden solche Links umgehend entfernt.",
  "imprint.dataprivacy.title": "Datenschutz:",
  "imprint.dataprivacy.description": "Es werden keine personenbezogenen Daten erhoben oder gespeichert, es sei denn, dies ist für den technischen Betrieb der Dokumentation unbedingt erforderlich. Wenn der Benutzer im Zustimmungsdialog Cookies akzeptiert, wird Google Analytics aktiviert und für eine anonymisierte Analyse der Website-Nutzung verwendet. Es werden keine Tracking-Cookies gesetzt, bis der Benutzer ausdrücklich seine Zustimmung gegeben hat.",
  "imprint.furtherinfo": "Weitere Informationen finden Sie in einer separaten Datenschutzerklärung.",

  "privacy.title": "Datenschutzerklärung",
  "privacy.lastupdated": "Zuletzt aktualisiert: 17. November 2025",
  "privacy.introduction": "Einleitung",
  "privacy.description": "Diese Datenschutzerklärung erläutert, wie personenbezogene Daten beim Besuch dieser Website erhoben, verwendet und geschützt werden. Durch die Nutzung dieser Seite stimmen Sie den in dieser Erklärung beschriebenen Praktiken zu.",
  "privacy.data.collection.title": "Datenerhebung",
  "privacy.data.collection.li1": "Es werden keine personenbezogenen Daten erhoben oder gespeichert, es sei denn, dies ist für den technischen Betrieb der Website unbedingt erforderlich.",
  "privacy.data.collection.li2": "Personenbezogene Daten dürfen nur verarbeitet werden, wenn Sie diese aktiv bereitstellen (z.B. Kontaktaufnahme mit dem Betreiber).",
  "privacy.cookies.analytics.title": "Verwendung von Cookies und Analysen",
  "privacy.cookies.analytics.li1": "Diese Website verwendet technische Cookies, die für grundlegende Website-Funktionen unerlässlich sind.",
  "privacy.cookies.analytics.li2": "Analytische Cookies (Google Analytics) werden nur aktiviert, wenn Sie über den Cookie-Zustimmungsdialog ausdrücklich zustimmen.",
  "privacy.cookies.analytics.li3": "Google Analytics wird in anonymisierter Form verwendet, um die Nutzung der Website zu analysieren und die Benutzererfahrung zu verbessern.",
  "privacy.cookies.analytics.li4": "Es werden keine Tracking- oder Analyse-Cookies gesetzt, bis Sie Cookies akzeptiert haben.",
  "privacy.datausage.title": "Datenverwendung und -weitergabe",
  "privacy.datausage.li1": "Personenbezogene Daten werden nicht verkauft oder an Dritte weitergegeben, es sei denn, dies ist gesetzlich vorgeschrieben.",
  "privacy.datausage.li2": "Daten, die über Google Analytics erhoben werden, werden gemäß der Datenschutzrichtlinie von Google verarbeitet und nicht für Profiling oder kommerzielle Zwecke verwendet.",
  "privacy.datasecurity.title": "Datensicherheit",
  "privacy.datasecurity.description": "Es werden angemessene technische und organisatorische Maßnahmen ergriffen, um personenbezogene Daten vor unbefugtem Zugriff, Verlust oder Manipulation zu schützen.",
  "privacy.yourrights.title": "Ihre Rechte",
  "privacy.yourrights.li1": "Sie haben das Recht, Auskunft über Ihre personenbezogenen Daten sowie deren Berichtigung oder Löschung im Rahmen der geltenden Gesetze zu verlangen.",
  "privacy.yourrights.li2": "Wenn Sie Fragen zum Datenschutz haben oder Ihre Rechte ausüben möchten, wenden Sie sich an den im Impressum genannten Betreiber.",
  "privacy.changes.title": "Änderungen dieser Datenschutzerklärung",
  "privacy.changes.description": "Die Datenschutzerklärung kann aktualisiert werden, um rechtliche oder technische Änderungen widerzuspiegeln. Wesentliche Änderungen werden auf dieser Seite kommuniziert.",
  "privacy.contact.title": "Kontakt:",
  "privacy.contact.description": "Bei Fragen zu dieser Datenschutzerklärung wenden Sie sich bitte an die im Impressum angegebenen Kontaktdaten.",

  "error.title": "Fehler",
  "error.description": "Seite nicht gefunden."
}