{
  "navbar.signals": "Signals",
  "navbar.poweron": "Power On",
  "navbar.poweroff": "Power Off",
  "navbar.setup": "SetUp",
  "navbar.settings": "Settings",
  "navbar.help": "Help",

  "app.impressum": "Imprint",
  "app.privacy": "Privacy Policy",
  "app.cookies.title": "Privacy-/Cookie-Einstellungen",
  "app.cookies.description": "We use cookies to enable Google Analytics. This can be changed at any time in the settings. Please choose:",
  "app.cookies.accept": "Accept all cookies",
  "app.cookies.reject": "Reject",

  "app.title": "RCC - Information Panel",
  "app.introduction": "This panel explaines the signal codes of the RCC (RGB Color LED Cube). It also gives information on how to setup the color and intensity of the LEDs. Information about the project can be found <a href=\"{{link}}\" target=\"_blank\">here</a>. For questions and suggestions, please open an issue on GitHub. To start the interaction just klick on the image below or switch to the different categories using the menu.",

  "app.copyright.published": "<b>g.raf^engineering</b>, published under <a href=\"{{link}}\" target=\"_blank\">{{name}}</a>.",
  "app.global.click": "Click to start interaction",

  "settings.theme.title": "Theme",
  "settings.theme.light": "Light",
  "settings.theme.dark": "Dark",
  "settings.location.title": "Location",
  "settings.language.selection": "Select Language",


  "settings.poweroff.title": "RCC - Power off sequence",
  "settings.poweroff.description": "After the button press detection signal (green), the shutdown sequence is activated if the button is held for 5 seconds! If the sequence is interrupted (button released), the RCC enters the setup mode!",
  
  "settings.help.title": "Help",
  "settings.help.description": "Help and instructions for using the RCC Information Panel.",
  
  "imprint.title": "Imprint",
  "imprint.description": "This is a personal, non-commercial website. The content is provided for informational and educational purposes only.",
  "imprint.responsible": "Responsible for Content:",
  "imprint.name": "R. GAECHTER",
  "imprint.location": "Austria",
  "imprint.contact": "LinkedIn:",
  "imprint.notice.title": "Notice",
  "imprint.notice.description": "This website is operated on a private basis and not associated with any business or commercial entity. No tax number, VAT ID, or business registration applies.",
  "imprint.liability.title": "Liability for Content:",
  "imprint.liability.description": "The contents of this website are created with care. However, no guarantee is given for the correctness, completeness, or timeliness of the content. As a private individual, I am responsible for my own content on these pages according to applicable laws. Continuous monitoring of third-party content (e.g., comments or external links) does not take place, but if I become aware of any violations of law, such content will be removed promptly.",
  "imprint.externallinks.title": "Liability for External Links:",
  "imprint.externallinks.description": "This website may contain links to external websites. I have no control over the contents of such websites and therefore accept no responsibility for them. At the time of linking, no legal violations were apparent. If any infringement becomes known, such links will be removed immediately.",
  "imprint.dataprivacy.title": "Data Privacy:",
  "imprint.dataprivacy.description": "No personal data is collected or stored unless it is strictly necessary for the technical operation of the documentation.If the user accepts cookies in the consent dialog, Google Analytics will be activated and used for anonymized website usage analysis. No tracking cookies are set until the user has given explicit permission.",
  "imprint.furtherinfo": "For further information, please refer to a separate Privacy Policy.",

  "privacy.title": "Privacy Policy",
  "privacy.lastupdated": "Last updated: November 17, 2025",
  "privacy.introduction": "Introduction",
  "privacy.description": "This privacy policy explains how personal information is collected, used, and protected when visiting this website. By using this site, you consent to the practices described in this notice.",
  "privacy.data.collection.title": "Data Collection",
  "privacy.data.collection.li1": "No personal information is collected or stored unless strictly necessary for the technical operation of the website.",
  "privacy.data.collection.li2": "Personal data may only be processed when you actively provide it (e.g., contacting the owner).",
  "privacy.cookies.analytics.title": "Use of Cookies and Analytics",
  "privacy.cookies.analytics.li1": "This site uses technical cookies that are essential for basic website functions.",
  "privacy.cookies.analytics.li2": "Analytical cookies (Google Analytics) are only activated if you give explicit consent via the cookie consent dialog.",
  "privacy.cookies.analytics.li3": "Google Analytics is used in anonymized form to analyze website usage and improve the user experience.",
  "privacy.cookies.analytics.li4": "No tracking or analytical cookies are set until you have accepted cookies.",
  "privacy.datausage.title": "Data Usage and Sharing",
  "privacy.datausage.li1": "Personal data is not sold or shared with third parties unless required by law.",
  "privacy.datausage.li2": "Data collected through Google Analytics is processed according to Google’s privacy policy and is not used for profiling or commercial purposes.",
  "privacy.datasecurity.title": "Data Security",
  "privacy.datasecurity.description": "Appropriate technical and organizational measures are implemented to protect personal data against unauthorized access, loss, or manipulation.",
  "privacy.yourrights.title": "Your Rights",
  "privacy.yourrights.li1": "You have the right to request information about your personal data, as well as correction or deletion, within the scope of applicable law.",
  "privacy.yourrights.li2": "If you have questions about data privacy or wish to exercise your rights, contact the site owner as listed in the Imprint.",
  "privacy.changes.title": "Changes to this Privacy Policy",
  "privacy.changes.description": "The privacy policy may be updated to reflect legal or technical changes. Significant changes will be communicated on this page.",
  "privacy.contact.title": "Contact:",
  "privacy.contact.description": "For inquiries regarding this privacy policy, please refer to the details in the Imprint.",

  "error.title": "Error",
  "error.description": "Page not found."
}